---
kind: method
id: M:Autodesk.Revit.DB.Analysis.PathOfTravel.GetCurves
source: html/7c222d22-ce15-daf8-aec8-01ed3098530c.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravel.GetCurves Method

Gets the array of curves representing the path of travel.

## Syntax (C#)
```csharp
public IList<Curve> GetCurves()
```

## Returns
The array of curves.